## 데이터 통합하기
- 데이터 조인
- 원리는 매우 매우 중요

In [11]:
# 필요한 라이브러리 불러오기
import numpy as np
import pandas as pd

In [14]:
print(pd.__version__)

2.1.4

In [33]:
df1 = pd.DataFrame({ 
    'Class1' : [95, 92, 98, 100],
    'Class2' : [91 ,93, 97, 90]})

df2 = pd.DataFrame({
    'Class1' : [87, 89],
    'Class2': [85, 90]})

df2

   Class1  Class2
0      87      85
1      89      90

In [17]:
# append() 메소드는 1.4.0 이후부터 지원을 하지않으므로
# pandas 버전을 1.4로 낮추거나, 코드를 새로운 버전에 맞춰서 코드 재수정을 하면 된다.
# df1.append(df2)

# df.concat() 메소드
# df1에 df2를 추가해서 데이터를 하나로 만들기
result = pd.concat([df1, df2])
result

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      90
0      87      85
1      89      90

In [19]:
df3 = pd.DataFrame({
    'Class1' : [96, 83]})

# 인덱스가 뒤죽박죽하게 나오는 것을 확인할 수 있다
pd.concat([result, df3])

   Class1  Class2
0      95    91.0
1      92    93.0
2      98    97.0
3     100    90.0
0      87    85.0
1      89    90.0
0      96     NaN
1      83     NaN

In [21]:
# ignore_index=True 옵션을 주어서 인덱스를 초기화 
pd.concat([result, df3], ignore_index=True)

   Class1  Class2
0      95    91.0
1      92    93.0
2      98    97.0
3     100    90.0
4      87    85.0
5      89    90.0
6      96     NaN
7      83     NaN

## 가로 방향으로 통합하기
- pd.concat() : 세로 방향으로 통합하기

In [25]:
df4 = pd.DataFrame({
    'Class3' : [93, 91, 95, 98]
})

# join 메소드 : 가로 방향으로 통합
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      90      98

In [27]:
# 인덱스 라벨을 지정
index_label = ['a','b','c','d']

df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]}, index= index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)

df1a.join(df4a)

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [30]:
# 인덱스 라벨을 지정
index_label = ['a','b','c','d']


f1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]})

df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)

df1a.join(df4a)

   Class1  Class2  Class3
0      95      91     NaN
1      92      93     NaN
2      98      97     NaN
3     100      99     NaN

In [32]:
# 인덱스 번호가 불일치한 상태에서 조인을 하는 경우 NaN(결측치) 값이 발생
# 즉, 인덱스를 체크해야 한다.
# 방법 : df1a.index == df4a.index

df1a.index == df4a.index

# 아래와 같이 False가 있는 경우 즉, 인덱스가 다른 경우
# 데이터의 손실이 발생할 수 있으므로 인덱스를 수정해야 한다.

array([False, False, False, False])